results/spring-quarkus-perf-comparison/2026-04-21_09-26-13/wrk-warmup-spring4-leyden-0.log
[0.001s][warning][os] NUMA support disabled: The process memory and cpu node configuration does not match
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.67ms   38.59ms 469.76ms   82.52%
    Req/Sec   2343.47    536.99  2856.00     80.00
  281216 requests in 120.04s,   1.49GB read
Requests/sec: 2342.69
Transfer/sec:  12.69MB